'use strict';

// Pairs start and end time
const PAIRS = [
  ['8.30', '10.05'],
  ['10.25', '12.00'],
  ['12.20', '13.55'],
  ['14.15', '15.50'],
  ['16.10', '17.45'],
  ['17.55', '19.30'],
];

// Breaks start and end time
const BREAKS = [
  ['6.00', '8.30'],
  ['10.05', '10.25'],
  ['12.00', '12.20'],
  ['13.55', '14.15'],
  ['15.50', '16.10'],
  ['17.45', '17.55'],
]

const TIMETABLE = {
  '8.30': '1) _08:30 – 10:05_',
  '10.25': '2) _10:25 – 12:00_',
  '12.20': '3) _12:20 – 13:55_',
  '14.15': '4) _14:15 – 15:50_',
  '16.10': '5) _16:10 – 17:45_',
  '17.55': '6) _17:55 - 19:30_',
};

const WEEKDAYS = [
  'Понеділок',
  'Вівторок',
  'Середа',
  'Четвер',
  'Пʼятниця',
  'Субота',
  'Неділя',
];

const LATIN_TO_CYRILLIC = {
  A: 'А',
  B: 'Б',
  V: 'В',
  G: 'Г',
  H: 'Г',
  D: 'Д',
  E: 'Е',
  Z: 'З',
  K: 'К',
  L: 'Л',
  M: 'М',
  N: 'Н',
  O: 'О',
  P: 'П',
  R: 'Р',
  S: 'С',
  T: 'Т',
  U: 'У',
  Y: 'У',
  F: 'Ф',
  C: 'Ц',
  I: 'І',
  X: 'Х',
};

module.exports = { TIMETABLE, WEEKDAYS, PAIRS, BREAKS, LATIN_TO_CYRILLIC };
